lvx/base/Catalogs/бит_вго_ОперацииВГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_вго_ОперацииВГО</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_вго_ВидыОперацийВГО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Comment>Тип операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_вго_ТипыОперацийВГО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Enums/бит_вго_ВидыОперацийВГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_вго_ВидыОперацийВГО</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОперацияПоставщика</Name>
					<Comment>Операция поставщика</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияПокупателя</Name>
					<Comment>Операция покупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Техническая</Name>
					<Comment>Техническая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_вго_ОперацииВГО/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;	
	Иначе
		Если ДанныеЗаполнения.Свойство("Parent") Тогда
			ТекущаяГруппа = ДанныеЗаполнения.Parent;
		ИначеЕсли ДанныеЗаполнения.Свойство("Родитель") Тогда
			ТекущаяГруппа = ДанныеЗаполнения.Родитель;
		Иначе
			Возврат;	
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяГруппа) Тогда
		
		ВидОперации = ТекущаяГруппа.ВидОперации;
		ТипОперации = ТекущаяГруппа.ТипОперации;
	
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если // Не ЭтоГруппа И
		(ВидОперации = Перечисления.бит_вго_ВидыОперацийВГО.ОперацияПокупателя
			ИЛИ ВидОперации = Перечисления.бит_вго_ВидыОперацийВГО.ОперацияПоставщика) Тогда
		ПроверяемыеРеквизиты.Добавить("ТипОперации"); 
	КонецЕсли;		
		
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли; 
	
	Если Не ЭтоНовый() И Не ПометкаУдаления = Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(Родитель) 
		И (ВидОперации <> Родитель.ВидОперации 
			ИЛИ (ЗначениеЗаполнено(Родитель.ТипОперации) И ТипОперации <> Родитель.ТипОперации)) Тогда
			
		ТекстСообщения = СтрШаблон(НСтр("ru='Невозможно записать элемент в группе %1. Вид операции и тип операции должны совпадать.';
										|en='Failed to record an element in the group %1. Form and type of operation must be the same.'"),
								   Родитель);						
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
